#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_team.repositorymanager_teams_collaborators_team_BCA4AB9D: Refreshing state... [id=4009231]
github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3: Refreshing state... [id=repository-manager]
github_repository.repositorymanager_repositories_website_repository_40CA684E: Refreshing state... [id=website]
github_repository.repositorymanager_repositories_base_repository_DC292971: Refreshing state... [id=base]
github_team_repository.repositorymanager_repositories_website_teamgithubteamrepositorymanagerteamscollaboratorsteamBCA4AB9Did_7CADE29C: Refreshing state... [id=4009231:website]
github_team_membership.repositorymanager_teams_collaborators_membershipcollaborators_D63F5027: Refreshing state... [id=4009231:skorfmann]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.repositorymanager_repositories_base_repository_DC292971 will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_base_repository_DC292971" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Repo for organizing things around cdk.dev"
        etag                   = "W/\"07cd50c08abcd1f2692c373b3df9ad1a\""
        full_name              = "cdk-dev/base"
        git_clone_url          = "git://github.com/cdk-dev/base.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/base"
        http_clone_url         = "https://github.com/cdk-dev/base.git"
        id                     = "base"
        is_template            = false
        name                   = "base"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODYwNTQ3NTM="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/base.git"
        svn_url                = "https://github.com/cdk-dev/base"
        topics                 = [
            "aws-cdk",
            "cdk",
            "cdk8s",
            "cdktf",
            "constructs",
            "jsii",
            "terraform-cdk",
        ]
    }

  # github_repository.repositorymanager_repositories_foobarza_repository_838AA6BD will be created
  + resource "github_repository" "repositorymanager_repositories_foobarza_repository_838AA6BD" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Repo for organizing things around cdk.dev"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + homepage_url           = "https://cdk.dev"
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "foobarza"
      + node_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "aws-cdk",
          + "cdk",
          + "cdk8s",
          + "cdktf",
          + "constructs",
          + "jsii",
          + "terraform-cdk",
        ]
    }

  # github_repository.repositorymanager_repositories_repositorymanager_repository_47ED2DF3 will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_repositorymanager_repository_47ED2DF3" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Manage repositories within this organization with Terraform CDK"
        etag                   = "W/\"07fe399c7c0e2331b25457ffd00f453b\""
        full_name              = "cdk-dev/repository-manager"
        git_clone_url          = "git://github.com/cdk-dev/repository-manager.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/repository-manager"
        http_clone_url         = "https://github.com/cdk-dev/repository-manager.git"
        id                     = "repository-manager"
        is_template            = false
        name                   = "repository-manager"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODc5NTQ4ODI="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/repository-manager.git"
        svn_url                = "https://github.com/cdk-dev/repository-manager"
        topics                 = [
            "cdk",
            "cdktf",
            "terraform-cdk",
        ]
    }

  # github_repository.repositorymanager_repositories_website_repository_40CA684E will be updated in-place
  ~ resource "github_repository" "repositorymanager_repositories_website_repository_40CA684E" {
      ~ allow_merge_commit     = false -> true
      ~ allow_rebase_merge     = false -> true
      ~ allow_squash_merge     = false -> true
        archived               = false
        auto_init              = false
        default_branch         = "master"
      ~ delete_branch_on_merge = false -> true
        description            = "Website for cdk.dev"
        etag                   = "W/\"247caaaff85b49f26f6acc7351b05cda\""
        full_name              = "cdk-dev/website"
        git_clone_url          = "git://github.com/cdk-dev/website.git"
        has_downloads          = false
        has_issues             = true
        has_projects           = false
        has_wiki               = false
        homepage_url           = "https://cdk.dev"
        html_url               = "https://github.com/cdk-dev/website"
        http_clone_url         = "https://github.com/cdk-dev/website.git"
        id                     = "website"
        is_template            = false
        name                   = "website"
        node_id                = "MDEwOlJlcG9zaXRvcnkyODYwNTI5MjA="
        private                = false
        ssh_clone_url          = "git@github.com:cdk-dev/website.git"
        svn_url                = "https://github.com/cdk-dev/website"
        topics                 = [
            "aws-cdk",
            "cdk",
            "cdk8s",
            "cdktf",
            "constructs",
            "jsii",
            "terraform-cdk",
        ]
    }

Plan: 1 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*